testing-scripts/test_multi-client_encrypted_h2load_throughput_via-B/results/payload-size_10000000____delay-ms_0____loss-rate-percent_0____clients-requests_10/6/result.txt
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 1.04s, 9.59 req/s, 91.51MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 95.40MB (100031270) total, 120B (120) headers (space savings 87.37%), 95.37MB (100000000) data
UDP datagram: 4848 sent, 82164 received
                     min         max         mean         sd        +/- sd
time for request:      1.00s       1.03s       1.01s      8.64ms    80.00%
time for connect:     4.13ms     25.51ms     14.69ms      7.19ms    60.00%
time to 1st byte:    25.20ms     28.96ms     27.12ms      1.41ms    70.00%
req/s           :       0.96        0.98        0.98        0.01    80.00%